app/Http/Controllers/Api/ReportController.php

    public function store(ReportRequest $request)
    {
        $authReportCount = Report::whereDate('created_at', Carbon::today())->where('user_id', auth('api')->user()->id)->count();

        // if ($authReportCount > 3) {
        //     return response()->json(["message" => "You have already submitted to many report within this day, please comeback tommorow to submit another report"], 403);
        // }

        if($request->picture != ''){
            $fileName = uniqid().time().'.jpg';
            $filePath = 'reports/'.$fileName;
            Storage::disk('public')->put($filePath, base64_decode($request->picture));
            $report = Report::create(array_merge($request->getData(), ['status' => 'Pending', 'user_id' => auth('api')->user()->id,'picture_name' => $fileName,'file_path' => $filePath]));

        } else {
            $report = Report::create(array_merge($request->getData(), ['status' => 'Pending', 'user_id' => auth('api')->user()->id]));
        }

        event(new ReportEvent($report->load('type')));
---
select * from `types` where `types`.`id` in (37)