app/Http/Controllers/Web/Taskforce/ReportTypeController.php

    public function index()
    {
        $types = Type::withCount('reports')->where('model_type', 'Report')->orderBy('created_at','DESC')->get();
        $types->add(new Type([ 'id' => 0, 'name' => 'Others', 'model_type' => 'Report', 'created_at' => now(), 'updated_at' => now(),
            'reports_count' => Report::where('type_id', NULL)->count() ]));
---
select count(*) as aggregate from `reports` where `type_id` is null