app/Http/Controllers/Web/Taskforce/ReportController.php

    public function index()
    {
        $reportsData =  DB::table('reports')
        ->selectRaw('count(*) as reports_count')
        ->selectRaw("count(case when status = 'Pending' then 1 end) as pending_count")
        ->selectRaw("count(case when status = 'Noted' then 1 end) as noted_count")
        ->selectRaw("count(case when status = 'Invalid' then 1 end) as invalid_count")
        ->selectRaw("count(case when status = 'Ignored' then 1 end) as ignored_count")
        ->where('created_at', '>=', date('Y-m-d',strtotime('first day of this month')))
        ->where('created_at', '<=', date('Y-m-d',strtotime('last day of this month')))
        ->first();

        $reports = Report::with('type')->orderBy('created_at','DESC')->get();
---
select count(*) as reports_count, count(case when status = 'Pending' then 1 end) as pending_count, count(case when status = 'Noted' then 1 end) as noted_count, count(case when status = 'Invalid' then 1 end) as invalid_count, count(case when status = 'Ignored' then 1 end) as ignored_count from `reports` where `created_at` >= '2021-11-01' and `created_at` <= '2021-11-30' limit 1
select * from `reports` order by `created_at` desc
select * from `types` where `types`.`id` in (36, 37, 38, 39, 40)

    public function show(Report $report)
    {
        if(request()->ajax()) {
            return (new ReportResource($report->load('type')))->additional(Helper::instance()->itemFound('report'));
---
select * from `types` where 0 = 1

    public function respond(RespondReportRequest $request, Report $report) {
        if(request()->ajax()) {
            $report->fill($request->validated())->save();
---
update `reports` set `admin_message` = 'asdasdasdasdsada', `status` = 'Invalid', `reports`.`updated_at` = '2021-11-15 04:24:29' where `id` = 76