app/Http/Controllers/Web/Admin/AndroidController.php

    public function index()
    {
        $androids = Android::orderBy('created_at','DESC')->get();
---
select * from `androids` order by `created_at` desc