app/Http/Controllers/Web/Admin/AuditLogController.php

select * from `users` where `users`.`id` in (3)
select count(case when event = 'created' then 1 end) as this_month_created_count, count(case when event = 'updated' then 1 end) as this_month_updated_count, count(case when event = 'deleted' then 1 end) as this_month_deleted_count from `activity_log` where log_name = 'information' and `created_at` >= '2021-11-01' and `created_at` <= '2021-11-30' limit 1
---
    public function index() {
        $firstDayMonth = date('Y-m-d',strtotime('first day of this month'));
        $lastDayMonth = date('Y-m-d',strtotime('last day of this month'));


        if (Auth::user()->user_role_id == 1) {

            $logs = Activity::orderBy('created_at', 'DESC')->with('causer')->get();

            $logsData =  DB::table('activity_log')
            ->selectRaw("count(case when event = 'created' then 1 end) as this_month_created_count")
            ->selectRaw("count(case when event = 'updated' then 1 end) as this_month_updated_count")
            ->selectRaw("count(case when event = 'deleted' then 1 end) as this_month_deleted_count")
            ->where('created_at', '>=', $firstDayMonth)
            ->where('created_at', '<=', $lastDayMonth)
            ->first();