app/Http/Controllers/Web/Admin/DashboardController.php

    public function informationAdmin() {

        $users = User::select('id', 'created_at')
            ->get()
            ->groupBy(function($date) {
                return Carbon::parse($date->created_at)->format('m'); // grouping by years
        });
---
select `id`, `created_at` from `users`

        $projectRawData = [];
        $projectChart = [];

        $projects = Project::select('id', 'created_at')
            ->whereYear('created_at', '=', date("Y") )
            ->get()
            ->groupBy(function($date) {
                return Carbon::parse($date->created_at)->format('m'); // grouping by years
        });
---
select `id`, `created_at` from `projects` where year(`created_at`) = '2021'

            }
        }

        $usersData = DB::table('users')
            ->selectRaw("count(case when created_at >='". date('Y-m-d',strtotime('first day of this month')) ."' AND created_at <='".date('Y-m-d',strtotime('last day of this month'))."' then 1 end) as this_month_count")
            ->selectRaw("count(case when user_role_id = 5 then 1 end) as information_staff_count")
            ->selectRaw("count(case when status = 'Disable' then 1 end) as blocked_user_count")
            ->first();

        $thisMonthProjectCount = $projectChart[date('m')];
        $verificationCount = UserVerification::where('status', 'Pending')->count();
        $announcementCount = Announcement::where('created_at', '>=', date('Y-m-d',strtotime('first day of this month')))
            ->where('created_at', '<=', date('Y-m-d',strtotime('last day of this month')))->count();

        $feedbacksData = DB::table('feedbacks')
            ->selectRaw("count(*) as this_month_total_feedbacks ")
            ->selectRaw("count(case when polarity = 'Positive' then 1 end) as this_month_positive_count")
            ->selectRaw("count(case when polarity = 'Neutral' then 1 end) as this_month_neutral_count")
            ->selectRaw("count(case when polarity = 'Negative' then 1 end) as this_month_negative_count")
            ->whereRaw("created_at >= '". date('Y-m-d',strtotime('first day of this month')) ."' AND created_at <='".date('Y-m-d',strtotime('last day of this month'))."'")
            ->first();
---
select count(case when created_at >='2021-11-01' AND created_at <='2021-11-30' then 1 end) as this_month_count, count(case when user_role_id = 5 then 1 end) as information_staff_count, count(case when status = 'Disable' then 1 end) as blocked_user_count from `users` limit 1
select count(*) as aggregate from `user_verifications` where `status` = 'Pending'
select count(*) as aggregate from `announcements` where `created_at` >= '2021-11-01' and `created_at` <= '2021-11-30'
select count(*) as this_month_total_feedbacks , count(case when polarity = 'Positive' then 1 end) as this_month_positive_count, count(case when polarity = 'Neutral' then 1 end) as this_month_neutral_count, count(case when polarity = 'Negative' then 1 end) as this_month_negative_count from `feedbacks` where created_at >= '2021-11-01' AND created_at <='2021-11-30' limit 1