app/Http/Controllers/Web/Admin/DocumentTypeController.php

    public function index()
    {
        $types = Type::withCount('documents')->where('model_type', 'Document')->orderBy('created_at','DESC')->get();
        $types->add(new Type([ 'id' => 0, 'name' => 'Others (Document w/o document type)', 'model_type' => 'Document', 'created_at' => now(), 'updated_at' => now(),
            'documents_count' => Document::where('type_id', NULL)->count() ]));
---
select count(*) as aggregate from `documents` where `type_id` is null

    public function show($id)
    {
        if ($id == 0) {
            $documents = Document::where('type_id', NULL)->orderBy('created_at', 'DESC')->get();
            $type = (new Type([ 'id' => 0, 'name' => 'Document w/o document type', 'model_type' => 'Document', 'created_at' => now(), 'updated_at' => now(),
            'documents_count' => $documents->count(), 'documents' => $documents ]));
---
select `types`.*, (select count(*) from `documents` where `types`.`id` = `documents`.`type_id`) as `documents_count` from `types` where `model_type` = 'Document' order by `created_at` desc