app/Http/Controllers/Web/Admin/FeedbackController.php

    public function index() {

        $first_date = date('Y-m-d',strtotime('first day of this month'));
        $last_date = date('Y-m-d',strtotime('last day of this month'));

        $feedbacksData =  DB::table('feedbacks')
        ->selectRaw('count(*) as feedbacks_count')
        ->selectRaw("count(case when status = 'Pending' then 1 end) as pending_count")
        ->selectRaw("count(case when status = 'Noted' then 1 end) as noted_count")
        ->selectRaw("count(case when status = 'Ignored' then 1 end) as ignored_count")
        ->selectRaw("avg(rating) as this_month_rating")
        ->where('created_at', '>=', $first_date)
        ->where('created_at', '<=', $last_date)
        ->first();

        $feedbacks = Feedback::with('type')->orderBy('updated_at','desc')->get();
---
select count(*) as feedbacks_count, count(case when status = 'Pending' then 1 end) as pending_count, count(case when status = 'Noted' then 1 end) as noted_count, count(case when status = 'Ignored' then 1 end) as ignored_count, count(case when polarity = 'Positive' then 1 end) as positive_count, count(case when polarity = 'Neutral' then 1 end) as neutral_count, count(case when polarity = 'Negative' then 1 end) as negative_count from `feedbacks` where `created_at` >= '2021-11-01' and `created_at` <= '2021-11-30' limit 1
select * from `feedbacks` order by `updated_at` desc
select * from `types` where `types`.`id` in (1, 2, 3)

    public function respondReport(RespondFeedbackRequest $request, Feedback $feedback) {
        if ($feedback->status === 'Noted' || $feedback->status === 'Ignored') { return response()->json(Helper::instance()->alreadyNoted('feedback'), 403); }
        $feedback->fill(['admin_respond' => $request->admin_respond,'status' => 'Noted'])->save();
        dispatch(new FeedbackJob($feedback));
        return (new FeedbackResource($feedback->load('type')))->additional(Helper::instance()->noted('feedback'));
---
update `feedbacks` set `admin_respond` = 'asdasdasda', `status` = 'Noted', `feedbacks`.`updated_at` = '2021-11-16 03:41:27' where `id` = 1132
select * from `types` where `types`.`id` in (1)