app/Http/Controllers/Web/Admin/OrdinanceTypeController.php

    public function index()
    {
        $types = Type::withCount('ordinances')->where('model_type', 'Ordinance')->orderBy('created_at','DESC')->get();
        $types->add(new Type([ 'id' => 0, 'name' => 'Others (Ordinance w/o ordinance type)', 'model_type' => 'Ordinance', 'created_at' => now(), 'updated_at' => now(),
            'ordinances_count' => Ordinance::where('type_id', NULL)->count() ]));
---
select count(*) as aggregate from `ordinances` where `type_id` is null

    public function show($id)
    {
        if ($id == 0) {
            $ordinances = Ordinance::where('type_id', NULL)->orderBy('created_at', 'DESC')->get();
            $type = (new Type([ 'id' => 0, 'name' => 'Ordinance w/o ordinance type', 'model_type' => 'Ordinance', 'created_at' => now(), 'updated_at' => now(),
            'ordinances_count' => $ordinances->count(), 'ordinances' => $ordinances ]));
---
select `types`.*, (select count(*) from `ordinances` where `types`.`id` = `ordinances`.`type_id`) as `ordinances_count` from `types` where `model_type` = 'Ordinance' order by `created_at` desc