app/Http/Controllers/Web/Admin/ProfileController.php

    public function index() {
        $user = User::with('user_role')->findOrFail(Auth::id());
---
select * from `user_roles` where `user_roles`.`id` in (2)
select * from `users` where `users`.`id` = 3 limit 1